RT-Thread/rt-thread/bsp/freescale/platform/devices/MKM34Z7/include/MKM34Z7_features.h
#define FSL_FEATURE_XBAR_INPUT54_ID (XBAR_IN_RESERVED54)
/* @brief XBAR input 55 ID. */
#define FSL_FEATURE_XBAR_INPUT55_ID (XBAR_IN_RESERVED55)
/* @brief XBAR input 56 ID. */
#define FSL_FEATURE_XBAR_INPUT56_ID (XBAR_IN_RESERVED56)
/* @brief XBAR input 57 ID. */
#define FSL_FEATURE_XBAR_INPUT57_ID (XBAR_IN_RESERVED57)
/* @brief XBAR input 58 ID. */
#define FSL_FEATURE_XBAR_INPUT58_ID (XBAR_IN_RESERVED58)
/* @brief XBAR input 59 ID. */
#define FSL_FEATURE_XBAR_INPUT59_ID (XBAR_IN_RESERVED59)
/* @brief XBAR input 60 ID. */
#define FSL_FEATURE_XBAR_INPUT60_ID (XBAR_IN_RESERVED60)
/* @brief XBAR input 61 ID. */
#define FSL_FEATURE_XBAR_INPUT61_ID (XBAR_IN_RESERVED61)
/* @brief XBAR input 62 ID. */
#define FSL_FEATURE_XBAR_INPUT62_ID (XBAR_IN_RESERVED62)
/* @brief XBAR input 63 ID. */
#define FSL_FEATURE_XBAR_INPUT63_ID (XBAR_IN_RESERVED63)
/* @brief XBAR input 64 ID. */
#define FSL_FEATURE_XBAR_INPUT64_ID (XBAR_IN_RESERVED64)
/* @brief XBAR input 65 ID. */
#define FSL_FEATURE_XBAR_INPUT65_ID (XBAR_IN_RESERVED65)
/* @brief XBAR input 66 ID. */
#define FSL_FEATURE_XBAR_INPUT66_ID (XBAR_IN_RESERVED66)
/* @brief XBAR input 67 ID. */
#define FSL_FEATURE_XBAR_INPUT67_ID (XBAR_IN_RESERVED67)
/* @brief XBAR input 68 ID. */
#define FSL_FEATURE_XBAR_INPUT68_ID (XBAR_IN_RESERVED68)
/* @brief XBAR input 69 ID. */
#define FSL_FEATURE_XBAR_INPUT69_ID (XBAR_IN_RESERVED69)
/* @brief XBAR input 70 ID. */
#define FSL_FEATURE_XBAR_INPUT70_ID (XBAR_IN_RESERVED70)
/* @brief XBAR input 71 ID. */
#define FSL_FEATURE_XBAR_INPUT71_ID (XBAR_IN_RESERVED71)
/* @brief XBAR input 72 ID. */
#define FSL_FEATURE_XBAR_INPUT72_ID (XBAR_IN_RESERVED72)
/* @brief XBAR input 73 ID. */
#define FSL_FEATURE_XBAR_INPUT73_ID (XBAR_IN_RESERVED73)
/* @brief XBAR input 74 ID. */
#define FSL_FEATURE_XBAR_INPUT74_ID (XBAR_IN_RESERVED74)
/* @brief XBAR input 75 ID. */
#define FSL_FEATURE_XBAR_INPUT75_ID (XBAR_IN_RESERVED75)
/* @brief XBAR input 76 ID. */
#define FSL_FEATURE_XBAR_INPUT76_ID (XBAR_IN_RESERVED76)
/* @brief XBAR input 77 ID. */
#define FSL_FEATURE_XBAR_INPUT77_ID (XBAR_IN_RESERVED77)
/* @brief XBAR input 78 ID. */
#define FSL_FEATURE_XBAR_INPUT78_ID (XBAR_IN_RESERVED78)
/* @brief XBAR input 79 ID. */
#define FSL_FEATURE_XBAR_INPUT79_ID (XBAR_IN_RESERVED79)
/* @brief XBAR input 80 ID. */
#define FSL_FEATURE_XBAR_INPUT80_ID (XBAR_IN_RESERVED80)
/* @brief XBAR input 81 ID. */
#define FSL_FEATURE_XBAR_INPUT81_ID (XBAR_IN_RESERVED81)
/* @brief XBAR input 82 ID. */
#define FSL_FEATURE_XBAR_INPUT82_ID (XBAR_IN_RESERVED82)
/* @brief XBAR input 83 ID. */
#define FSL_FEATURE_XBAR_INPUT83_ID (XBAR_IN_RESERVED83)
/* @brief XBAR input 84 ID. */
#define FSL_FEATURE_XBAR_INPUT84_ID (XBAR_IN_RESERVED84)
/* @brief XBAR input 85 ID. */
#define FSL_FEATURE_XBAR_INPUT85_ID (XBAR_IN_RESERVED85)
/* @brief XBAR input 86 ID. */
#define FSL_FEATURE_XBAR_INPUT86_ID (XBAR_IN_RESERVED86)
/* @brief XBAR input 87 ID. */
#define FSL_FEATURE_XBAR_INPUT87_ID (XBAR_IN_RESERVED87)
/* @brief XBAR input 88 ID. */
#define FSL_FEATURE_XBAR_INPUT88_ID (XBAR_IN_RESERVED88)
/* @brief XBAR input 89 ID. */
#define FSL_FEATURE_XBAR_INPUT89_ID (XBAR_IN_RESERVED89)
/* @brief XBAR input 90 ID. */
#define FSL_FEATURE_XBAR_INPUT90_ID (XBAR_IN_RESERVED90)
/* @brief XBAR input 91 ID. */
#define FSL_FEATURE_XBAR_INPUT91_ID (XBAR_IN_RESERVED91)
/* @brief XBAR input 92 ID. */
#define FSL_FEATURE_XBAR_INPUT92_ID (XBAR_IN_RESERVED92)
/* @brief XBAR input 93 ID. */
#define FSL_FEATURE_XBAR_INPUT93_ID (XBAR_IN_RESERVED93)
/* @brief XBAR input 94 ID. */
#define FSL_FEATURE_XBAR_INPUT94_ID (XBAR_IN_RESERVED94)
/* @brief XBAR input 95 ID. */
#define FSL_FEATURE_XBAR_INPUT95_ID (XBAR_IN_RESERVED95)
/* @brief XBAR input 96 ID. */
#define FSL_FEATURE_XBAR_INPUT96_ID (XBAR_IN_RESERVED96)
/* @brief XBAR input 97 ID. */
#define FSL_FEATURE_XBAR_INPUT97_ID (XBAR_IN_RESERVED97)
/* @brief XBAR input 98 ID. */
#define FSL_FEATURE_XBAR_INPUT98_ID (XBAR_IN_RESERVED98)
/* @brief XBAR input 99 ID. */
#define FSL_FEATURE_XBAR_INPUT99_ID (XBAR_IN_RESERVED99)
/* @brief XBAR input 100 ID. */
#define FSL_FEATURE_XBAR_INPUT100_ID (XBAR_IN_RESERVED100)
/* @brief XBAR input 101 ID. */
#define FSL_FEATURE_XBAR_INPUT101_ID (XBAR_IN_RESERVED101)
/* @brief XBAR input 102 ID. */
#define FSL_FEATURE_XBAR_INPUT102_ID (XBAR_IN_RESERVED102)
/* @brief XBAR input 103 ID. */
#define FSL_FEATURE_XBAR_INPUT103_ID (XBAR_IN_RESERVED103)
/* @brief XBAR input 104 ID. */
#define FSL_FEATURE_XBAR_INPUT104_ID (XBAR_IN_RESERVED104)
/* @brief XBAR input 105 ID. */
#define FSL_FEATURE_XBAR_INPUT105_ID (XBAR_IN_RESERVED105)
/* @brief XBAR input 106 ID. */
#define FSL_FEATURE_XBAR_INPUT106_ID (XBAR_IN_RESERVED106)
/* @brief XBAR input 107 ID. */
#define FSL_FEATURE_XBAR_INPUT107_ID (XBAR_IN_RESERVED107)
/* @brief XBAR input 108 ID. */
#define FSL_FEATURE_XBAR_INPUT108_ID (XBAR_IN_RESERVED108)
/* @brief XBAR input 109 ID. */
#define FSL_FEATURE_XBAR_INPUT109_ID (XBAR_IN_RESERVED109)
/* @brief XBAR input 110 ID. */
#define FSL_FEATURE_XBAR_INPUT110_ID (XBAR_IN_RESERVED110)
/* @brief XBAR input 111 ID. */
#define FSL_FEATURE_XBAR_INPUT111_ID (XBAR_IN_RESERVED111)
/* @brief XBAR input 112 ID. */
#define FSL_FEATURE_XBAR_INPUT112_ID (XBAR_IN_RESERVED112)
/* @brief XBAR input 113 ID. */
#define FSL_FEATURE_XBAR_INPUT113_ID (XBAR_IN_RESERVED113)
/* @brief XBAR input 114 ID. */
#define FSL_FEATURE_XBAR_INPUT114_ID (XBAR_IN_RESERVED114)
/* @brief XBAR input 115 ID. */
#define FSL_FEATURE_XBAR_INPUT115_ID (XBAR_IN_RESERVED115)
/* @brief XBAR input 116 ID. */
#define FSL_FEATURE_XBAR_INPUT116_ID (XBAR_IN_RESERVED116)
/* @brief XBAR input 117 ID. */
#define FSL_FEATURE_XBAR_INPUT117_ID (XBAR_IN_RESERVED117)
/* @brief XBAR input 118 ID. */
#define FSL_FEATURE_XBAR_INPUT118_ID (XBAR_IN_RESERVED118)
/* @brief XBAR input 119 ID. */
#define FSL_FEATURE_XBAR_INPUT119_ID (XBAR_IN_RESERVED119)
/* @brief XBAR input 120 ID. */
#define FSL_FEATURE_XBAR_INPUT120_ID (XBAR_IN_RESERVED120)
/* @brief XBAR input 121 ID. */
#define FSL_FEATURE_XBAR_INPUT121_ID (XBAR_IN_RESERVED121)
/* @brief XBAR input 122 ID. */
#define FSL_FEATURE_XBAR_INPUT122_ID (XBAR_IN_RESERVED122)
/* @brief XBAR input 123 ID. */
#define FSL_FEATURE_XBAR_INPUT123_ID (XBAR_IN_RESERVED123)
/* @brief XBAR input 124 ID. */
#define FSL_FEATURE_XBAR_INPUT124_ID (XBAR_IN_RESERVED124)
/* @brief XBAR input 125 ID. */
#define FSL_FEATURE_XBAR_INPUT125_ID (XBAR_IN_RESERVED125)
/* @brief XBAR input 126 ID. */
#define FSL_FEATURE_XBAR_INPUT126_ID (XBAR_IN_RESERVED126)
/* @brief XBAR input 127 ID. */
#define FSL_FEATURE_XBAR_INPUT127_ID (XBAR_IN_RESERVED127)
/* @brief XBAR output 0 ID. */
#define FSL_FEATURE_XBAR_OUTPUT0_ID (XB_DMA_INT0)
/* @brief XBAR output 1 ID. */
#define FSL_FEATURE_XBAR_OUTPUT1_ID (XB_DMA_INT1)
/* @brief XBAR output 2 ID. */
#define FSL_FEATURE_XBAR_OUTPUT2_ID (XB_DMA_INT2)
/* @brief XBAR output 3 ID. */
#define FSL_FEATURE_XBAR_OUTPUT3_ID (XB_DMA_INT3)
/* @brief XBAR output 4 ID. */
#define FSL_FEATURE_XBAR_OUTPUT4_ID (CMP2_Sample_Window_Input)
/* @brief XBAR output 5 ID. */
#define FSL_FEATURE_XBAR_OUTPUT5_ID (TMR_CH0_SecInput)
/* @brief XBAR output 6 ID. */
#define FSL_FEATURE_XBAR_OUTPUT6_ID (TMR_CH1_SecInput)
/* @brief XBAR output 7 ID. */
#define FSL_FEATURE_XBAR_OUTPUT7_ID (TMR_CH2_SecInput)
/* @brief XBAR output 8 ID. */
#define FSL_FEATURE_XBAR_OUTPUT8_ID (TMR_CH3_SecInput)
/* @brief XBAR output 9 ID. */
#define FSL_FEATURE_XBAR_OUTPUT9_ID (TMR_CLK_Input1)
/* @brief XBAR output 10 ID. */
#define FSL_FEATURE_XBAR_OUTPUT10_ID (TMR_CLK_Input2)
/* @brief XBAR output 11 ID. */
#define FSL_FEATURE_XBAR_OUTPUT11_ID (CMP0_Sample_Window_Input)
/* @brief XBAR output 12 ID. */
#define FSL_FEATURE_XBAR_OUTPUT12_ID (CMP1_Sample_Window_Input)
/* @brief XBAR output 13 ID. */
#define FSL_FEATURE_XBAR_OUTPUT13_ID (UART_RX_Input)
/* @brief XBAR output 14 ID. */
#define FSL_FEATURE_XBAR_OUTPUT14_ID (UART_TX_Output)
/* @brief XBAR output 15 ID. */
#define FSL_FEATURE_XBAR_OUTPUT15_ID (ADC_TRGA)
/* @brief XBAR output 16 ID. */
#define FSL_FEATURE_XBAR_OUTPUT16_ID (ADC_TRGB)
/* @brief XBAR output 17 ID. */
#define FSL_FEATURE_XBAR_OUTPUT17_ID (XB_OUT0)
/* @brief XBAR output 18 ID. */
#define FSL_FEATURE_XBAR_OUTPUT18_ID (XB_OUT1)
/* @brief XBAR output 19 ID. */
#define FSL_FEATURE_XBAR_OUTPUT19_ID (XB_OUT2)
/* @brief XBAR output 20 ID. */
#define FSL_FEATURE_XBAR_OUTPUT20_ID (XB_OUT3)
/* @brief XBAR output 21 ID. */
#define FSL_FEATURE_XBAR_OUTPUT21_ID (XB_OUT4)
/* @brief XBAR output 22 ID. */
#define FSL_FEATURE_XBAR_OUTPUT22_ID (XB_OUT5)
/* @brief XBAR output 23 ID. */
#define FSL_FEATURE_XBAR_OUTPUT23_ID (XB_OUT6)
/* @brief XBAR output 24 ID. */
#define FSL_FEATURE_XBAR_OUTPUT24_ID (XB_OUT7)
/* @brief XBAR output 25 ID. */
#define FSL_FEATURE_XBAR_OUTPUT25_ID (XB_OUT8)
/* @brief XBAR output 26 ID. */
#define FSL_FEATURE_XBAR_OUTPUT26_ID (ADC_TRGC)
/* @brief XBAR output 27 ID. */
#define FSL_FEATURE_XBAR_OUTPUT27_ID (ADC_TRGD)
/* @brief XBAR output 28 ID. */
#define FSL_FEATURE_XBAR_OUTPUT28_ID (AFE_CH0_TGR)
/* @brief XBAR output 29 ID. */
#define FSL_FEATURE_XBAR_OUTPUT29_ID (AFE_CH1_TGR)
/* @brief XBAR output 30 ID. */
#define FSL_FEATURE_XBAR_OUTPUT30_ID (AFE_CH2_TGR)
/* @brief XBAR output 31 ID. */
#define FSL_FEATURE_XBAR_OUTPUT31_ID (AFE_CH3_TGR)
/* @brief XBAR output 32 ID. */
#define FSL_FEATURE_XBAR_OUTPUT32_ID (EWM_IN)
/* @brief XBAR output 33 ID. */
#define FSL_FEATURE_XBAR_OUTPUT33_ID (XB_OUT9)
/* @brief XBAR output 34 ID. */
#define FSL_FEATURE_XBAR_OUTPUT34_ID (XB_OUT10)
/* @brief XBAR output 35 ID. */
#define FSL_FEATURE_XBAR_OUTPUT35_ID (PDB0_PreTrigger0_ACK)
/* @brief XBAR output 36 ID. */
#define FSL_FEATURE_XBAR_OUTPUT36_ID (PDB0_PreTrigger1_ACK)
/* @brief XBAR output 37 ID. */
#define FSL_FEATURE_XBAR_OUTPUT37_ID (PDB0_PreTrigger2_ACK)
/* @brief XBAR output 38 ID. */
#define FSL_FEATURE_XBAR_OUTPUT38_ID (PDB0_PreTrigger3_ACK)
/* @brief XBAR output 39 ID. */
#define FSL_FEATURE_XBAR_OUTPUT39_ID (PDB0_Trigger_Input)
/* @brief XBAR output 40 ID. */
#define FSL_FEATURE_XBAR_OUTPUT40_ID (AFE_Ch0_ExMod_Data)
/* @brief XBAR output 41 ID. */
#define FSL_FEATURE_XBAR_OUTPUT41_ID (AFE_Ch1_ExMod_Data)
/* @brief XBAR output 42 ID. */
#define FSL_FEATURE_XBAR_OUTPUT42_ID (AFE_Ch2_ExMod_Data)
/* @brief XBAR output 43 ID. */
#define FSL_FEATURE_XBAR_OUTPUT43_ID (AFE_Ch3_ExMod_Data)
/* @brief XBAR output 44 ID. */
#define FSL_FEATURE_XBAR_OUTPUT44_ID (XBAR_OUT_RESERVED44)
/* @brief XBAR output 45 ID. */
#define FSL_FEATURE_XBAR_OUTPUT45_ID (XBAR_OUT_RESERVED45)
/* @brief XBAR output 46 ID. */
#define FSL_FEATURE_XBAR_OUTPUT46_ID (XBAR_OUT_RESERVED46)
/* @brief XBAR output 47 ID. */
#define FSL_FEATURE_XBAR_OUTPUT47_ID (XBAR_OUT_RESERVED47)
/* @brief XBAR output 48 ID. */
#define FSL_FEATURE_XBAR_OUTPUT48_ID (XBAR_OUT_RESERVED48)
/* @brief XBAR output 49 ID. */
#define FSL_FEATURE_XBAR_OUTPUT49_ID (XBAR_OUT_RESERVED49)
/* @brief XBAR output 50 ID. */
#define FSL_FEATURE_XBAR_OUTPUT50_ID (XBAR_OUT_RESERVED50)
/* @brief XBAR output 51 ID. */
#define FSL_FEATURE_XBAR_OUTPUT51_ID (XBAR_OUT_RESERVED51)
/* @brief XBAR output 52 ID. */
#define FSL_FEATURE_XBAR_OUTPUT52_ID (XBAR_OUT_RESERVED52)
/* @brief XBAR output 53 ID. */
#define FSL_FEATURE_XBAR_OUTPUT53_ID (XBAR_OUT_RESERVED53)
/* @brief XBAR output 54 ID. */
#define FSL_FEATURE_XBAR_OUTPUT54_ID (XBAR_OUT_RESERVED54)
/* @brief XBAR output 55 ID. */
#define FSL_FEATURE_XBAR_OUTPUT55_ID (XBAR_OUT_RESERVED55)
/* @brief XBAR output 56 ID. */
#define FSL_FEATURE_XBAR_OUTPUT56_ID (XBAR_OUT_RESERVED56)
/* @brief XBAR output 57 ID. */
#define FSL_FEATURE_XBAR_OUTPUT57_ID (XBAR_OUT_RESERVED57)
/* @brief XBAR output 58 ID. */
#define FSL_FEATURE_XBAR_OUTPUT58_ID (XBAR_OUT_RESERVED58)
/* @brief XBAR output 59 ID. */
#define FSL_FEATURE_XBAR_OUTPUT59_ID (XBAR_OUT_RESERVED59)
/* @brief XBAR output 60 ID. */
#define FSL_FEATURE_XBAR_OUTPUT60_ID (XBAR_OUT_RESERVED60)
/* @brief XBAR output 61 ID. */
#define FSL_FEATURE_XBAR_OUTPUT61_ID (XBAR_OUT_RESERVED61)
/* @brief XBAR output 62 ID. */
#define FSL_FEATURE_XBAR_OUTPUT62_ID (XBAR_OUT_RESERVED62)
/* @brief XBAR output 63 ID. */
#define FSL_FEATURE_XBAR_OUTPUT63_ID (XBAR_OUT_RESERVED63)
/* @brief XBAR output 64 ID. */
#define FSL_FEATURE_XBAR_OUTPUT64_ID (XBAR_OUT_RESERVED64)
/* @brief XBAR output 65 ID. */
#define FSL_FEATURE_XBAR_OUTPUT65_ID (XBAR_OUT_RESERVED65)
/* @brief XBAR output 66 ID. */
#define FSL_FEATURE_XBAR_OUTPUT66_ID (XBAR_OUT_RESERVED66)
/* @brief XBAR output 67 ID. */
#define FSL_FEATURE_XBAR_OUTPUT67_ID (XBAR_OUT_RESERVED67)
/* @brief XBAR output 68 ID. */
#define FSL_FEATURE_XBAR_OUTPUT68_ID (XBAR_OUT_RESERVED68)
/* @brief XBAR output 69 ID. */
#define FSL_FEATURE_XBAR_OUTPUT69_ID (XBAR_OUT_RESERVED69)
/* @brief XBAR output 70 ID. */
#define FSL_FEATURE_XBAR_OUTPUT70_ID (XBAR_OUT_RESERVED70)
/* @brief XBAR output 71 ID. */
#define FSL_FEATURE_XBAR_OUTPUT71_ID (XBAR_OUT_RESERVED71)
/* @brief XBAR output 72 ID. */
#define FSL_FEATURE_XBAR_OUTPUT72_ID (XBAR_OUT_RESERVED72)
/* @brief XBAR output 73 ID. */
#define FSL_FEATURE_XBAR_OUTPUT73_ID (XBAR_OUT_RESERVED73)
/* @brief XBAR output 74 ID. */
#define FSL_FEATURE_XBAR_OUTPUT74_ID (XBAR_OUT_RESERVED74)
/* @brief XBAR output 75 ID. */
#define FSL_FEATURE_XBAR_OUTPUT75_ID (XBAR_OUT_RESERVED75)
/* @brief XBAR output 76 ID. */
#define FSL_FEATURE_XBAR_OUTPUT76_ID (XBAR_OUT_RESERVED76)
/* @brief XBAR output 77 ID. */
#define FSL_FEATURE_XBAR_OUTPUT77_ID (XBAR_OUT_RESERVED77)
/* @brief XBAR output 78 ID. */
#define FSL_FEATURE_XBAR_OUTPUT78_ID (XBAR_OUT_RESERVED78)
/* @brief XBAR output 79 ID. */
#define FSL_FEATURE_XBAR_OUTPUT79_ID (XBAR_OUT_RESERVED79)
/* @brief XBAR output 80 ID. */
#define FSL_FEATURE_XBAR_OUTPUT80_ID (XBAR_OUT_RESERVED80)
/* @brief XBAR output 81 ID. */
#define FSL_FEATURE_XBAR_OUTPUT81_ID (XBAR_OUT_RESERVED81)
/* @brief XBAR output 82 ID. */
#define FSL_FEATURE_XBAR_OUTPUT82_ID (XBAR_OUT_RESERVED82)
/* @brief XBAR output 83 ID. */
#define FSL_FEATURE_XBAR_OUTPUT83_ID (XBAR_OUT_RESERVED83)
/* @brief XBAR output 84 ID. */
#define FSL_FEATURE_XBAR_OUTPUT84_ID (XBAR_OUT_RESERVED84)
/* @brief XBAR output 85 ID. */
#define FSL_FEATURE_XBAR_OUTPUT85_ID (XBAR_OUT_RESERVED85)
/* @brief XBAR output 86 ID. */
#define FSL_FEATURE_XBAR_OUTPUT86_ID (XBAR_OUT_RESERVED86)
/* @brief XBAR output 87 ID. */
#define FSL_FEATURE_XBAR_OUTPUT87_ID (XBAR_OUT_RESERVED87)
/* @brief XBAR output 88 ID. */
#define FSL_FEATURE_XBAR_OUTPUT88_ID (XBAR_OUT_RESERVED88)
/* @brief XBAR output 89 ID. */
#define FSL_FEATURE_XBAR_OUTPUT89_ID (XBAR_OUT_RESERVED89)
/* @brief XBAR output 90 ID. */
#define FSL_FEATURE_XBAR_OUTPUT90_ID (XBAR_OUT_RESERVED90)
/* @brief XBAR output 91 ID. */
#define FSL_FEATURE_XBAR_OUTPUT91_ID (XBAR_OUT_RESERVED91)
/* @brief XBAR output 92 ID. */
#define FSL_FEATURE_XBAR_OUTPUT92_ID (XBAR_OUT_RESERVED92)
/* @brief XBAR output 93 ID. */
#define FSL_FEATURE_XBAR_OUTPUT93_ID (XBAR_OUT_RESERVED93)
/* @brief XBAR output 94 ID. */
#define FSL_FEATURE_XBAR_OUTPUT94_ID (XBAR_OUT_RESERVED94)
/* @brief XBAR output 95 ID. */
#define FSL_FEATURE_XBAR_OUTPUT95_ID (XBAR_OUT_RESERVED95)
/* @brief XBAR output 96 ID. */
#define FSL_FEATURE_XBAR_OUTPUT96_ID (XBAR_OUT_RESERVED96)
/* @brief XBAR output 97 ID. */
#define FSL_FEATURE_XBAR_OUTPUT97_ID (XBAR_OUT_RESERVED97)
/* @brief XBAR output 98 ID. */
#define FSL_FEATURE_XBAR_OUTPUT98_ID (XBAR_OUT_RESERVED98)
/* @brief XBAR output 99 ID. */
#define FSL_FEATURE_XBAR_OUTPUT99_ID (XBAR_OUT_RESERVED99)
/* @brief XBAR output 100 ID. */
#define FSL_FEATURE_XBAR_OUTPUT100_ID (XBAR_OUT_RESERVED100)
/* @brief XBAR output 101 ID. */
#define FSL_FEATURE_XBAR_OUTPUT101_ID (XBAR_OUT_RESERVED101)
/* @brief XBAR output 102 ID. */
#define FSL_FEATURE_XBAR_OUTPUT102_ID (XBAR_OUT_RESERVED102)
/* @brief XBAR output 103 ID. */
#define FSL_FEATURE_XBAR_OUTPUT103_ID (XBAR_OUT_RESERVED103)
/* @brief XBAR output 104 ID. */
#define FSL_FEATURE_XBAR_OUTPUT104_ID (XBAR_OUT_RESERVED104)
/* @brief XBAR output 105 ID. */
#define FSL_FEATURE_XBAR_OUTPUT105_ID (XBAR_OUT_RESERVED105)
/* @brief XBAR output 106 ID. */
#define FSL_FEATURE_XBAR_OUTPUT106_ID (XBAR_OUT_RESERVED106)
/* @brief XBAR output 107 ID. */
#define FSL_FEATURE_XBAR_OUTPUT107_ID (XBAR_OUT_RESERVED107)
/* @brief XBAR output 108 ID. */
#define FSL_FEATURE_XBAR_OUTPUT108_ID (XBAR_OUT_RESERVED108)
/* @brief XBAR output 109 ID. */
#define FSL_FEATURE_XBAR_OUTPUT109_ID (XBAR_OUT_RESERVED109)
/* @brief XBAR output 110 ID. */
#define FSL_FEATURE_XBAR_OUTPUT110_ID (XBAR_OUT_RESERVED110)
/* @brief XBAR output 111 ID. */
#define FSL_FEATURE_XBAR_OUTPUT111_ID (XBAR_OUT_RESERVED111)
/* @brief XBAR output 112 ID. */
#define FSL_FEATURE_XBAR_OUTPUT112_ID (XBAR_OUT_RESERVED112)
/* @brief XBAR output 113 ID. */
#define FSL_FEATURE_XBAR_OUTPUT113_ID (XBAR_OUT_RESERVED113)
/* @brief XBAR output 114 ID. */
#define FSL_FEATURE_XBAR_OUTPUT114_ID (XBAR_OUT_RESERVED114)
/* @brief XBAR output 115 ID. */
#define FSL_FEATURE_XBAR_OUTPUT115_ID (XBAR_OUT_RESERVED115)
/* @brief XBAR output 116 ID. */
#define FSL_FEATURE_XBAR_OUTPUT116_ID (XBAR_OUT_RESERVED116)
/* @brief XBAR output 117 ID. */
#define FSL_FEATURE_XBAR_OUTPUT117_ID (XBAR_OUT_RESERVED117)
/* @brief XBAR output 118 ID. */
#define FSL_FEATURE_XBAR_OUTPUT118_ID (XBAR_OUT_RESERVED118)
/* @brief XBAR output 119 ID. */
#define FSL_FEATURE_XBAR_OUTPUT119_ID (XBAR_OUT_RESERVED119)
/* @brief XBAR output 120 ID. */
#define FSL_FEATURE_XBAR_OUTPUT120_ID (XBAR_OUT_RESERVED120)
/* @brief XBAR output 121 ID. */
#define FSL_FEATURE_XBAR_OUTPUT121_ID (XBAR_OUT_RESERVED121)
/* @brief XBAR output 122 ID. */
#define FSL_FEATURE_XBAR_OUTPUT122_ID (XBAR_OUT_RESERVED122)
/* @brief XBAR output 123 ID. */
#define FSL_FEATURE_XBAR_OUTPUT123_ID (XBAR_OUT_RESERVED123)
/* @brief XBAR output 124 ID. */
#define FSL_FEATURE_XBAR_OUTPUT124_ID (XBAR_OUT_RESERVED124)
/* @brief XBAR output 125 ID. */
#define FSL_FEATURE_XBAR_OUTPUT125_ID (XBAR_OUT_RESERVED125)
/* @brief XBAR output 126 ID. */
#define FSL_FEATURE_XBAR_OUTPUT126_ID (XBAR_OUT_RESERVED126)
/* @brief XBAR output 127 ID. */
#define FSL_FEATURE_XBAR_OUTPUT127_ID (XBAR_OUT_RESERVED127)

#endif /* __FSL_MKM34Z7_FEATURES_H__ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
